/**
 * Запитати у користувача рік народження.

Запитати в нього, в якому місті він живе.

Запитати його улюблений вид спорту.

При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

Його вік.

Якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і
 на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.

Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому
 повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

 
Все це має бути відображено в одному вікні (алерті).


Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести
 свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .
 */

const YEAR = +prompt('Введіть рік народження:',1984);
if(YEAR === 1984) alert('Шкода, що Ви не захотіли ввести свій вік :-(');

const CITY = prompt('Введіть ваше місто:','Жуч');
if(CITY === 'Жуч') alert('Шкода, що Ви не захотіли ввести своє місто :-(');

const SPORT = prompt('Введіть ваш улюблений вид спорту:','Диванінг:-)'); 
if(SPORT === 'Диванінг:-)') alert('Шкода, що Ви не захотіли ввести свій спорт, диван вас врятує :-)');

let COUNTRY = ''; 
let CHEMP = '';

switch (CITY) {
    case "Київ":
            COUNTRY = "Ти живеш у столиці України"
        break;
    case "Вашингтон":
            COUNTRY = "Ти живеш у столиці Америки"
        break;
    case "Лондон":
            COUNTRY = "Ти живеш у столиці Великобританії"
        break;

    default:
            COUNTRY = (`Ти живеш у місті ${CITY}`);
            break;


}

switch (SPORT) {
    case "Бокс":
            CHEMP = "Круто! Хочеш стати Олександром Усиком?"
        break;
    case "Формула 1":
            CHEMP = "Круто! Хочеш стати Льюисом Хэмилтоном?"
        break;
    case "Параплан":
            CHEMP = "Круто! Хочеш стати Кристианом Маурером?"
        break;

     default:
    //         CHEMP = (`Навіть не мрій стати Валерієм Залужним!!!`);//не вказано в завданні!
    break;

}

//alert('end');
alert(`Вік: ${(2022-YEAR)},
${COUNTRY},
${CHEMP} `);